In [1]:
import pandas as pd
import numpy as np

create a datafram from tuple

In [4]:
playersAge = pd.DataFrame({'Player Name':['Rahul Dravid','Virat Kholi','Vinod Kamble'], 'Age' : [30,24,22]})

In [6]:
playersAge

    Player Name  Age
0  Rahul Dravid   30
1   Virat Kholi   24
2  Vinod Kamble   22

In [64]:
playerSalary = pd.DataFrame({'Player Name' : ['Rahul Dravid','Virat Kholi','Harbhajan'] ,'Salary' :[45,60,44] })

In [16]:
playerSalary

    Player Name  Salary in lakhs
0  Rahul Dravid                45
1   Virat Kholi                60
2     Harbhajan                44

Find all the retrival infomation like head, tail, 2 records ,display alternate rows, coloumn names, max and min values

In [19]:
playersAge.head()

    Player Name  Age
0  Rahul Dravid   30
1   Virat Kholi   24
2  Vinod Kamble   22

In [21]:
playersAge.head(1)

    Player Name  Age
0  Rahul Dravid   30

In [23]:
playersAge.tail(2)

    Player Name  Age
1   Virat Kholi   24
2  Vinod Kamble   22

In [27]:
playerSalary.columns

Index(['Player Name', 'Salary in lakhs '], dtype='object')

In [29]:
playersAge[:0:2]

Empty DataFrame
Columns: [Player Name, Age]
Index: []

In [31]:
playersAge[0::2]

    Player Name  Age
0  Rahul Dravid   30
2  Vinod Kamble   22

In [68]:
playerSalary['Salary'].max()

60

In [70]:
playerSalary['Salary'].min()

44

In [72]:
playersAge['Age'].max()

30

In [74]:
playersAge['Age'].min()

22

To find maximum salary name

In [87]:
playerSalary[playerSalary['Salary'] > 50]['Player Name']

1    Virat Kholi
Name: Player Name, dtype: object

playerSalary[[playerSalary['Salary'] > 50]['Player Name','Salary']]

MERGING

In [104]:
dfMergeinner = pd.merge(playersAge,playerSalary, on='Player Name', how ='inner') ## INNER JOIN

In [108]:
dfMergeinner

    Player Name  Age  Salary
0  Rahul Dravid   30      45
1   Virat Kholi   24      60

In [112]:
dfMergeLeft = pd.merge(playersAge,playerSalary, on='Player Name', how ='left') ## left JOIN --- left table is Player Age

In [114]:
dfMergeLeft

    Player Name  Age  Salary
0  Rahul Dravid   30    45.0
1   Virat Kholi   24    60.0
2  Vinod Kamble   22     NaN

In [116]:
dfMergeLeft = pd.merge(playerSalary,playersAge, on='Player Name', how ='left') ## left JOIN --- left table is Player Salary
dfMergeLeft

    Player Name  Salary   Age
0  Rahul Dravid      45  30.0
1   Virat Kholi      60  24.0
2     Harbhajan      44   NaN

In [118]:
dfMergeRight = pd.merge(playerSalary,playersAge, on='Player Name', how ='right') ## left JOIN --- right table is Player Age
dfMergeRight

    Player Name  Salary  Age
0  Rahul Dravid    45.0   30
1   Virat Kholi    60.0   24
2  Vinod Kamble     NaN   22

In [120]:
dfMergeRight = pd.merge(playersAge,playerSalary, on='Player Name', how ='left') ## left JOIN --- right table is Player age
dfMergeRight

    Player Name  Age  Salary
0  Rahul Dravid   30    45.0
1   Virat Kholi   24    60.0
2  Vinod Kamble   22     NaN

In [122]:
dfMergeOuter = pd.merge(playerSalary,playersAge, on='Player Name', how ='outer') ## outer JOIN 
dfMergeOuter

    Player Name  Salary   Age
0     Harbhajan    44.0   NaN
1  Rahul Dravid    45.0  30.0
2  Vinod Kamble     NaN  22.0
3   Virat Kholi    60.0  24.0

In [124]:
dfMergeOuter = pd.merge(playersAge,playerSalary, on='Player Name', how ='outer') ## Outer JOIN --- right table is Player age
dfMergeOuter

    Player Name   Age  Salary
0     Harbhajan   NaN    44.0
1  Rahul Dravid  30.0    45.0
2  Vinod Kamble  22.0     NaN
3   Virat Kholi  24.0    60.0

When the column names are different , how to join the columns

In [148]:
playerSalary.rename(columns={"Player Name": "Sportsmen"}, inplace=True) # changing the name of the coloumn
playerSalary

       Sportmen  Salary
0  Rahul Dravid      45
1   Virat Kholi      60
2     Harbhajan      44

In [150]:
playerSalary

       Sportmen  Salary
0  Rahul Dravid      45
1   Virat Kholi      60
2     Harbhajan      44

In [152]:
dfMerge = pd.merge(playersAge,playerSalary, left_on='Player Name' , right_on ='Sportmen') #join with different col names
dfMerge

    Player Name  Age      Sportmen  Salary
0  Rahul Dravid   30  Rahul Dravid      45
1   Virat Kholi   24   Virat Kholi      60

In [154]:
dfMergeleft = pd.merge(playersAge,playerSalary, left_on='Player Name' , right_on ='Sportmen',how ='left') #join with different col names
dfMergeleft

    Player Name  Age      Sportmen  Salary
0  Rahul Dravid   30  Rahul Dravid    45.0
1   Virat Kholi   24   Virat Kholi    60.0
2  Vinod Kamble   22           NaN     NaN

concatination of tables using df.concat

In [166]:
dfconcat1 = pd.concat([playersAge,playerSalary])
dfconcat1

    Player Name   Age      Sportmen  Salary
0  Rahul Dravid  30.0           NaN     NaN
1   Virat Kholi  24.0           NaN     NaN
2  Vinod Kamble  22.0           NaN     NaN
0           NaN   NaN  Rahul Dravid    45.0
1           NaN   NaN   Virat Kholi    60.0
2           NaN   NaN     Harbhajan    44.0

In [163]:
dfconcat = pd.concat([playersAge,playerSalary],ignore_index=True , axis=1)  # ignore_index = will use index as 0,1,2,3.. axis = 1 , will add rows beside
dfconcat

              0   1             2   3
0  Rahul Dravid  30  Rahul Dravid  45
1   Virat Kholi  24   Virat Kholi  60
2  Vinod Kamble  22     Harbhajan  44

To check for a condition and use to replace using where()

In [178]:
dfconcat1

    Player Name   Age      Sportmen  Salary
0  Rahul Dravid  30.0           NaN     NaN
1   Virat Kholi  24.0           NaN     NaN
2  Vinod Kamble  22.0           NaN     NaN
0           NaN   NaN  Rahul Dravid    45.0
1           NaN   NaN   Virat Kholi    60.0
2           NaN   NaN     Harbhajan    44.0

In [186]:
dfconcat1.where(dfconcat1['Salary']>50.0 ,'More')

  Player Name   Age     Sportmen Salary
0        More  More         More   More
1        More  More         More   More
2        More  More         More   More
0        More  More         More   More
1         NaN   NaN  Virat Kholi   60.0
2        More  More         More   More

GROUP BY

In [197]:
climate = pd.DataFrame({'City' :['Delhi','Delhi','Delhi','Delhi','Pune','Pune','Pune','Pune'],
                        'Temp':[35,33,38,35,49,50,44,48],
                        'Wind' : [10,8,7,10,15,12,11,13] })
climate

    City  Temp  Wind
0  Delhi    35    10
1  Delhi    33     8
2  Delhi    38     7
3  Delhi    35    10
4   Pune    49    15
5   Pune    50    12
6   Pune    44    11
7   Pune    48    13

In [201]:
df1 =climate.groupby('City') #df1 is a dataframe grouped by city , it has col name city and the rows under, but cannot output , so need to iterate 
df1

In [207]:
for citycount, group in df1:
    print(f"\nCity: {citycount}")
    print(group)  # Displays the subset of data for that city

City: Delhi
    City  Temp  Wind
0  Delhi    35    10
1  Delhi    33     8
2  Delhi    38     7
3  Delhi    35    10

City: Pune
   City  Temp  Wind
4  Pune    49    15
5  Pune    50    12
6  Pune    44    11
7  Pune    48    13

In [209]:
df1.get_group('Delhi') # will get result in that group

    City  Temp  Wind
0  Delhi    35    10
1  Delhi    33     8
2  Delhi    38     7
3  Delhi    35    10

In [211]:
df1.get_group('Pune').max()

City    Pune
Temp      50
Wind      15
dtype: object

In [213]:
climate.max()

City    Pune
Temp      50
Wind      15
dtype: object